; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj2 obj5 - airport
	obj1 obj3 obj6 - city
	obj4 - location
	obj7 obj9 obj17 - truck
	obj8 obj10 obj12 obj13 obj14 obj15 obj16 - package
	obj11 - airplane
)

(:init
	(at obj15 obj4)
	(in-city obj2 obj3)
	(at obj9 obj2)
	(at obj14 obj4)
	(in-city obj4 obj1)
	(in-city obj5 obj6)
	(in-city obj0 obj1)
	(at obj11 obj5)
	(at obj12 obj5)
	(at obj13 obj4)
	(at obj10 obj4)
	(at obj17 obj4)
	(at obj7 obj5)
	(at obj16 obj4)
	(at obj8 obj0)
)

(:goal (and
	(at obj15 obj4)
	(at obj14 obj4)
	(at obj13 obj0)
	(at obj10 obj0)
	(at obj16 obj0)
	(at obj12 obj0)
	(at obj8 obj2)
))
)

; plan
1. (load obj17 obj16 obj4)
   deleted: (at obj16 obj4)
   added: (in obj16 obj17)
   goals met: 2 of 7
2. (load obj17 obj13 obj4)
   deleted: (at obj13 obj4)
   added: (in obj13 obj17)
   goals met: 2 of 7
3. (load obj17 obj10 obj4)
   deleted: (at obj10 obj4)
   added: (in obj10 obj17)
   goals met: 2 of 7
4. (drive obj17 obj4 obj0)
   deleted: (at obj17 obj4)
   added: (at obj17 obj0)
   goals met: 2 of 7
5. (unload obj17 obj16 obj0)
   deleted: (in obj16 obj17)
   added: (at obj16 obj0)
   goals met: 3 of 7
6. (unload obj17 obj13 obj0)
   deleted: (in obj13 obj17)
   added: (at obj13 obj0)
   goals met: 4 of 7
7. (unload obj17 obj10 obj0)
   deleted: (in obj10 obj17)
   added: (at obj10 obj0)
   goals met: 5 of 7
8. (load obj11 obj12 obj5)
   deleted: (at obj12 obj5)
   added: (in obj12 obj11)
   goals met: 5 of 7
9. (fly obj11 obj5 obj0)
   deleted: (at obj11 obj5)
   added: (at obj11 obj0)
   goals met: 5 of 7
10. (load obj11 obj8 obj0)
   deleted: (at obj8 obj0)
   added: (in obj8 obj11)
   goals met: 5 of 7
11. (unload obj11 obj12 obj0)
   deleted: (in obj12 obj11)
   added: (at obj12 obj0)
   goals met: 6 of 7
12. (fly obj11 obj0 obj2)
   deleted: (at obj11 obj0)
   added: (at obj11 obj2)
   goals met: 6 of 7
13. (unload obj11 obj8 obj2)
   deleted: (in obj8 obj11)
   added: (at obj8 obj2)
   goals met: 7 of 7
